# -*- org-hide-emphasis-markers: t; -*-
* Deterministic finalization (example) 
#+BEGIN_SRC rust :results output :output plain
struct HasDrop {x:i32}

impl Drop for HasDrop {
    fn drop(&mut self) {
        println!("Dropping {}!", self.x);
    }
}

fn takes(x:HasDrop) {}
fn borrows(x:&HasDrop) {}

fn main() {
    let x = HasDrop{x:1};
    let x = HasDrop{x:2};
    {
      let x = HasDrop{x:3};
      let x = HasDrop{x:4};
    }
    let x = HasDrop{x:5};
    takes(x);
    let x = HasDrop{x:6};
    borrows(&x);
    let x = HasDrop{x:7};
}
#+END_SRC
#+RESULTS:
: Dropping 4!
: Dropping 3!
: Dropping 5!
: Dropping 7!
: Dropping 6!
: Dropping 2!
: Dropping 1!
